<?php

/**
 * $a = 1234; // десятичное число
 * $a = 0123; // восьмеричное число (эквивалентно 83 в десятичной системе)
 * $a = 0x1A; // шестнадцатеричное число (эквивалентно 26 в десятичной системе)
 * $a = 0b11111111; // двоичное число (эквивалентно 255 в десятичной системе)
 */

var_dump((int) (25/7)); // int(3)
var_dump(round(25/7));  // float(4)

// TRUE => 1, FALSE => 0
// NULL => 0
var_dump((int) ((0.1+0.7) * 10)); // выводит 7!

$foo = 1 + "10.5";                // $foo это float (11.5)
$foo = 1 + "-1.3e3";              // $foo это float (-1299)
$foo = 1 + "bob-1.3e3";           // $foo это integer (1)
$foo = 1 + "bob3";                // $foo это integer (1)
$foo = 1 + "10 Small Pigs";       // $foo это integer (11)
$foo = 4 + "10.2 Little Piggies"; // $foo это float (14.2)
$foo = "10.0 pigs " + 1;          // $foo это float (11)
$foo = "10.0 pigs " + 1.0;        // $foo это float (11)